'''
Напишите программу, которая определяет время суток по введённому часу  (в 24-часовом формате).
Утро: с 5:00 до 11:59 (5 <= час < 12)
День: с 12:00 до 16:59 (12 <= час < 17)
Вечер: с 17:00 до 21:59 (17 <= час < 22)
Ночь: с 22:00 до 4:59 (все остальные случаи)
На вход программе подаётся натуральное число - количество часов в 24-х часовом формате. На выходе программа должна печатать в терминал: "Утро" "День" "Вечер" или "Ночь" в зависимости от числа.
'''

hour = int(input())

if 5 <= hour < 12:
    print('Утро')
elif 12 <= hour < 17:
    print('День')
elif 17 <= hour < 22:
    print('Вечер')
else:
    print('Ночь')