'''
Напишите программу для проверки введённого пароля на соответствие следующим требованиям:
1. Длина пароля:
Пароль должен содержать не менее 8 символов
Если пароль короче, вывести: "Слишком короткий!"
2. Совпадение с эталоном:
Эталонный пароль хранится в переменной correct_password = "qwerty123"
Если введённый пароль совпадает с эталоном, вывести: "Доступ разрешён"
Если не совпадает — "Неверный пароль"

Пароль вводится пользователем с клавиатуры.
'''
correct_password = "qwerty123"
password = input()

if len(password) < 8:
    print('Слишком короткий!')
elif correct_password == password:
    print("Доступ разрешён")
else:
    print("Неверный пароль")