'''
Определить сезон года по номеру месяца.
Проверить, попадает ли число в диапазон [10, 20].
Проверить, является ли число двузначным и чётным.
Проверить, может ли человек получить водительские права: возраст ≥ 18 и есть медицинская справка.

'''

x = int(input('введите x >> '))
y = int(input('введите y >> '))

if x > 0 and y > 0:
    print('первая четверть плоскости')
elif x < 0 and y > 0:
    print('четвертая четверть плоскости')
elif x < 0 and y < 0:
    print('третья четверть плоскости')
else:
    print('вторая четверть плоскости')